#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

#### Preview environment 🔗
[https://86e75a7bf5c49762ecb6c6edcf7055cd-skjer.bekk.dev/](https://86e75a7bf5c49762ecb6c6edcf7055cd-skjer.bekk.dev/)

<details><summary>Show plan for apply after merge to master</summary>

```hcl

terraform
Acquiring state lock. This may take a few moments...
module.aws-deploy.random_string.suffix: Refreshing state... [id=qEfYxm4Yp5ww8yLZNIUznb3WEcouCvaY]
module.aws-deploy.data.aws_route53_zone.selected: Reading...
module.aws-deploy.data.aws_region.current: Reading...
module.aws-deploy.data.aws_lb.selected: Reading...
module.aws-deploy.data.aws_iam_role.ecs_task_role: Reading...
module.aws-deploy.data.aws_vpc.selected: Reading...
module.aws-deploy.data.aws_iam_role.ecs_task_execution_role: Reading...
module.aws-deploy.data.aws_secretsmanager_secret.main[0]: Reading...
module.aws-deploy.data.aws_ecs_cluster.selected: Reading...
module.aws-deploy.data.aws_lb_listener.selected: Reading...
module.aws-deploy.data.aws_security_group.selected: Reading...
module.aws-deploy.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.aws-deploy.data.aws_iam_role.ecs_task_execution_role: Read complete after 0s [id=bekk-ecsTaskExecutionRole-dev]
module.aws-deploy.data.aws_iam_role.ecs_task_role: Read complete after 0s [id=bekk-ecsTaskRole-dev]
module.aws-deploy.data.aws_security_group.selected: Read complete after 0s [id=sg-097e0d70b6ec82ec0]
module.aws-deploy.data.aws_ecs_cluster.selected: Read complete after 1s [id=arn:aws:ecs:eu-central-1:882089634282:cluster/bekk-ecs-cluster-dev]
module.aws-deploy.data.aws_secretsmanager_secret.main[0]: Read complete after 1s [id=arn:aws:secretsmanager:eu-central-1:882089634282:secret:bekk-arrangement-svc-dev-FhTZ4v]
module.aws-deploy.aws_ecs_task_definition.main: Refreshing state... [id=bekk-arrangement-svc-dev]
module.aws-deploy.data.aws_lb_listener.selected: Read complete after 1s [id=arn:aws:elasticloadbalancing:eu-central-1:882089634282:listener/app/bekk-lb-ecs-dev/6d410fcf59ca9e6f/da09c5a7670ad5a8]
module.aws-deploy.data.aws_route53_zone.selected: Read complete after 1s [id=Z04411953P8CDQG39NSHW]
module.aws-deploy.data.aws_vpc.selected: Read complete after 1s [id=vpc-0942da75cd65bf8e0]
module.aws-deploy.data.aws_subnets.private: Reading...
module.aws-deploy.aws_lb_target_group.main: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:882089634282:targetgroup/arrangement-svc-dev/d7f4bacf88001e70]
module.aws-deploy.data.aws_lb.selected: Read complete after 1s [id=arn:aws:elasticloadbalancing:eu-central-1:882089634282:loadbalancer/app/bekk-lb-ecs-dev/6d410fcf59ca9e6f]
module.aws-deploy.aws_route53_record.main[0]: Refreshing state... [id=Z04411953P8CDQG39NSHW_skjer.bekk.dev_A]
module.aws-deploy.data.aws_subnets.private: Read complete after 0s [id=eu-central-1]
module.aws-deploy.aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:eu-central-1:882089634282:service/bekk-ecs-cluster-dev/bekk-arrangement-svc-dev]
module.aws-deploy.aws_lb_listener_rule.main: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:882089634282:listener-rule/app/bekk-lb-ecs-dev/6d410fcf59ca9e6f/da09c5a7670ad5a8/bc07e8037c928025]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.aws-deploy.aws_ecs_service.main will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:eu-central-1:882089634282:service/bekk-ecs-cluster-dev/bekk-arrangement-svc-dev"
        name                               = "bekk-arrangement-svc-dev"
        tags                               = {
            "Terraform" = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:882089634282:task-definition/bekk-arrangement-svc-dev:62" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.aws-deploy.aws_ecs_task_definition.main must be replaced
-/+ resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:882089634282:task-definition/bekk-arrangement-svc-dev:62" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ environment      = [
                      - {
                          - name  = "ASPNETCORE_ENVIRONMENT"
                          - value = "Development"
                        },
                        {
                            name  = "Auth0__Audience"
                            value = "QHQy75S7tmnhDdBGYSnszzlhMPul0fAE"
                        },
                        # (5 unchanged elements hidden)
                        {
                            name  = "DD_VERSION"
                            value = "latest"
                        },
                      ~ {
                          ~ name  = "Serilog__MinimumLevel" -> "DOTNET_ENVIRONMENT"
                          ~ value = "Warning" -> "Development"
                        },
                      ~ {
                          ~ name  = "VIRTUAL_PATH" -> "Sendgrid__Dev_White_List_Addresses"
                          ~ value = "/arrangement-svc" -> "bjorn.ivar.strom@bekk.no, hong.nhung.thi.vo@bekk.no, simen.endsjo@bekk.no, simendsjo@gmail.com, tora.gunstad@bekk.no, ingrid.larssen@bekk.no"
                        },
                    ]
                    name             = "bekk-arrangement-svc-dev"
                    # (8 unchanged elements hidden)
                } # forces replacement,
              ~ {
                  - cpu                   = 0 -> null
                  - environment           = [] -> null
                  - mountPoints           = [] -> null
                    name                  = "log_router"
                  - portMappings          = [] -> null
                  - user                  = "0" -> null
                  - volumesFrom           = [] -> null
                    # (4 unchanged elements hidden)
                } # forces replacement,
              ~ {
                  - cpu              = 0 -> null
                  - mountPoints      = [] -> null
                    name             = "datadog_agent"
                  - volumesFrom      = [] -> null
                    # (6 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "bekk-arrangement-svc-dev" -> (known after apply)
      ~ revision                 = 62 -> (known after apply)
        tags                     = {
            "Name"      = "bekk-arrangement-svc-dev"
            "Terraform" = "true"
        }
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @simendsjo, Action: `pull_request`*